#include<conio.h>
#include<stdio.h>
#include<time.h>
#include<Windows.h>
#include<string.h>
#include "gammon.h"

void rules()
{
	extern int color1, color2;
	
	system("cls");
	SetColor(15, color1);
	printf("\n\n               Правила гри в довгi нарди                  \n\n");
	SetColor(15, 0);
		printf("    1. На початку гри всi фiшки знаходятся на головi.     \n\n");
		printf("    2. За один хiд з голови можна брати тiльки одну     \n");
		printf(" фiшку.    \n");
		printf("    Виключення у випадку, коли на початку гри   \n");
		printf(" випадають кiсточки 3:3, в цьому випадку з голови можна зняти  \n");
		printf(" другий раз.    \n\n");
		printf("    3. Цiль гри заключається в том, що гравець повинен   \n");
		printf(" пройти всiма фiшками повне коло (проти часової стрiлки),  \n");
		printf(" зайти ними в 'дiм', i зробити це ранiше нiж супротивник \n");
		printf("    4. Пiсля кидання кiсточок гравець пересуває будь-яку свою \n");
		printf(" фiшку на число клiток, рiвне випавшому числу одного з \n");
		printf(" кубикiв, а потiм будь-яку iншу фiшку на число, рiвне   \n");
		printf(" випавшому числу другого кубика, або можно пересунути  \n");
		printf(" одну фiшку на число рiвне сумi випавших кiсточок.\n");
		printf("    Якщо випали кубики з однаковими числами, то гравець  \n");
		printf(" ходить 4 раза будь-якими фiшками на це число. Причому     \n");
		printf(" може, як одною походити одразу на всi 4 ходи, так i     \n");
		printf(" рiзими 4 рази по одному ходу.\n\n");
		printf("    5. Неможна ставити свої фiшки на фiшки супротивника, \n");
		printf(" але можна ставити на свої.\n\n");
		printf("    6. Пропускати хiд неможна, тiльки якщо у вас немає можливостi \n");
		printf(" зробити хiд, то його пропускають.\n\n");
		SetColor(15, 60);
		printf("\n\n   Натиснiть будь яку клавiшу, для повернення в меню       \n\n");
	SetColor(15, 0);
}

